def find_two_largest_numbers():
    """
    Находит два наибольших числа в списке целых чисел.

    Программа считывает количество элементов в списке и сами элементы.
    Затем она определяет и выводит два наибольших числа из списка.

    Формат входных данных:
    Первая строка содержит одно целое число n (3 ≤ n ≤ 10^5).
    Вторая строка содержит n целых чисел, разделенных пробелами.

    Формат выходных данных:
    Два наибольших числа из списка, разделенные пробелом.

    Пример:
    >>> find_two_largest_numbers()
    Ввод:
    6
    15 1 4 7 9 3
    Вывод:
    15 9
    """
    n = int(input())
    a = list(map(int, input().split()))

    # Проверяем, что количество введенных элементов соответствует n
    if len(a) != n:
        print("Ошибка: количество введенных элементов не соответствует указанному числу.")
        return

    if n < 2:
        print("Ошибка: список должен содержать не менее двух элементов.")
        return

    mx1 = max(a[0], a[1])
    mx2 = min(a[0], a[1])

    for i in range(2, n):
        if a[i] > mx1:
            mx2 = mx1
            mx1 = a[i]
        elif a[i] > mx2:
            mx2 = a[i]

    print(mx1, mx2)

find_two_largest_numbers()
