def insertion_sort():
    """
    Сортирует список целых чисел с использованием алгоритма сортировки вставками.

    Программа считывает количество элементов в списке и сами элементы.
    Затем она сортирует список и выводит отсортированные элементы.

    Формат входных данных:
    Первая строка содержит одно целое число n (3 ≤ n ≤ 10^3).
    Вторая строка содержит n целых чисел, разделенных пробелами.

    Формат выходных данных:
    Отсортированный список целых чисел.

    Пример:
    >>> insertion_sort()
    Ввод:
    5
    2 7 4 5 1 5
    Вывод:
    1 2 4 5 5 7
    """
    n = int(input())
    a = list(map(int, input().split()))

    for i in range(1, n):
        x = a[i]
        j = i - 1
        while j >= 0 and a[j] > x:
            a[j + 1] = a[j]
            j -= 1
        a[j + 1] = x

    print(*a)

insertion_sort()
