def main():
    """
    Определяет победителя игры между Петей и Васей на основе заданных параметров.

    Игра начинается с n предметов. Игроки по очереди берут 1, p или v предметов.
    Петя ходит первым. Если игрок не может сделать ход, он проигрывает.

    Входные данные:
        Первая строка входных данных содержит три целых числа, разделенных пробелом:
        n (общее количество предметов), p и v (максимальное количество предметов,
        которое можно взять за один ход для Пети и Васи соответственно).

    Выходные данные:
        Выводит имя победителя: "Petya" или "Vasya".
    """
    import sys
    n, p, v = map(int, sys.stdin.readline().split())
    dp0 = [False] * (n + 1)
    dp1 = [False] * (n + 1)

    for i in range(1, n + 1):
        dp0[i] = (i >= 1 and not dp1[i - 1]) or (i >= p and not dp1[i - p])
        dp1[i] = (i >= 1 and not dp0[i - 1]) or (i >= v and not dp0[i - v])

    print("Petya" if dp0[n] else "Vasya")

if __name__ == "__main__":
    main()
